program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3405.2.1"}, {"coremlc-version", "3404.23.1"}, {"coremltools-component-torch", "2.3.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "7.2.1"}})]
{
    func main<ios17>(tensor<fp32, [1, 3, 392, 518]> image) {
            tensor<string, []> image_to_fp16_dtype_0 = const()[name = tensor<string, []>("image_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [3, 1, 1]> mean_to_fp16 = const()[name = tensor<string, []>("mean_to_fp16"), val = tensor<fp16, [3, 1, 1]>([[[0x1.eecp+6]], [[0x1.d1p+6]], [[0x1.9ep+6]]])];
            tensor<fp16, [1, 3, 392, 518]> cast_86 = cast(dtype = image_to_fp16_dtype_0, x = image)[name = tensor<string, []>("cast_86")];
            tensor<fp16, [1, 3, 392, 518]> tensor_cast_fp16 = sub(x = cast_86, y = mean_to_fp16)[name = tensor<string, []>("tensor_cast_fp16")];
            tensor<fp16, [3, 1, 1]> _inversed_pixel_values_3_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_pixel_values_3_y_0_to_fp16"), val = tensor<fp16, [3, 1, 1]>([[[0x1.188p-6]], [[0x1.1ecp-6]], [[0x1.1d8p-6]]])];
            tensor<fp16, [1, 3, 392, 518]> _inversed_pixel_values_3_cast_fp16 = mul(x = tensor_cast_fp16, y = _inversed_pixel_values_3_y_0_to_fp16)[name = tensor<string, []>("_inversed_pixel_values_3_cast_fp16")];
            tensor<int32, []> var_44 = const()[name = tensor<string, []>("op_44"), val = tensor<int32, []>(1)];
            tensor<int32, [2]> var_76 = const()[name = tensor<string, []>("op_76"), val = tensor<int32, [2]>([14, 14])];
            tensor<int32, [2]> var_78 = const()[name = tensor<string, []>("op_78"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> var_80_pad_type_0 = const()[name = tensor<string, []>("op_80_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> var_80_pad_0 = const()[name = tensor<string, []>("op_80_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [384, 3, 14, 14]> model_backbone_embeddings_patch_embeddings_projection_weight_to_fp16 = const()[name = tensor<string, []>("model_backbone_embeddings_patch_embeddings_projection_weight_to_fp16"), val = tensor<fp16, [384, 3, 14, 14]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [384]> model_backbone_embeddings_patch_embeddings_projection_bias_to_fp16 = const()[name = tensor<string, []>("model_backbone_embeddings_patch_embeddings_projection_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(451712)))];
            tensor<fp16, [1, 384, 28, 37]> var_80_cast_fp16 = conv(bias = model_backbone_embeddings_patch_embeddings_projection_bias_to_fp16, dilations = var_78, groups = var_44, pad = var_80_pad_0, pad_type = var_80_pad_type_0, strides = var_76, weight = model_backbone_embeddings_patch_embeddings_projection_weight_to_fp16, x = _inversed_pixel_values_3_cast_fp16)[name = tensor<string, []>("op_80_cast_fp16")];
            tensor<int32, [3]> concat_0 = const()[name = tensor<string, []>("concat_0"), val = tensor<int32, [3]>([1, 384, 1036])];
            tensor<fp16, [1, 384, 1036]> var_81_cast_fp16 = reshape(shape = concat_0, x = var_80_cast_fp16)[name = tensor<string, []>("op_81_cast_fp16")];
            tensor<int32, [3]> embeddings_1_perm_0 = const()[name = tensor<string, []>("embeddings_1_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<bool, []> embeddings_3_interleave_0 = const()[name = tensor<string, []>("embeddings_3_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 1, 384]> model_backbone_embeddings_cls_token_to_fp16 = const()[name = tensor<string, []>("model_backbone_embeddings_cls_token_to_fp16"), val = tensor<fp16, [1, 1, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(452544)))];
            tensor<fp16, [1, 1036, 384]> transpose_22 = transpose(perm = embeddings_1_perm_0, x = var_81_cast_fp16)[name = tensor<string, []>("transpose_22")];
            tensor<fp16, [1, 1037, 384]> embeddings_3_cast_fp16 = concat(axis = var_44, interleave = embeddings_3_interleave_0, values = (model_backbone_embeddings_cls_token_to_fp16, transpose_22))[name = tensor<string, []>("embeddings_3_cast_fp16")];
            tensor<fp32, []> var_98_scale_factor_height_0 = const()[name = tensor<string, []>("op_98_scale_factor_height_0"), val = tensor<fp32, []>(0x1.84d7ep-1)];
            tensor<fp32, []> var_98_scale_factor_width_0 = const()[name = tensor<string, []>("op_98_scale_factor_width_0"), val = tensor<fp32, []>(0x1.00b12p+0)];
            tensor<bool, []> var_98_align_corners_0 = const()[name = tensor<string, []>("op_98_align_corners_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 384, 37, 37]> input_1_to_fp16 = const()[name = tensor<string, []>("input_1_to_fp16"), val = tensor<fp16, [1, 384, 37, 37]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(453376)))];
            tensor<fp16, [1, 384, 28, 37]> var_98_cast_fp16 = upsample_bilinear(align_corners = var_98_align_corners_0, scale_factor_height = var_98_scale_factor_height_0, scale_factor_width = var_98_scale_factor_width_0, x = input_1_to_fp16)[name = tensor<string, []>("op_98_cast_fp16")];
            tensor<int32, [4]> var_100 = const()[name = tensor<string, []>("op_100"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<int32, [3]> var_102 = const()[name = tensor<string, []>("op_102"), val = tensor<int32, [3]>([1, -1, 384])];
            tensor<fp16, [1, 28, 37, 384]> transpose_21 = transpose(perm = var_100, x = var_98_cast_fp16)[name = tensor<string, []>("transpose_21")];
            tensor<fp16, [1, 1036, 384]> patch_pos_embed_cast_fp16 = reshape(shape = var_102, x = transpose_21)[name = tensor<string, []>("patch_pos_embed_cast_fp16")];
            tensor<bool, []> var_106_interleave_0 = const()[name = tensor<string, []>("op_106_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 1037, 384]> var_106_cast_fp16 = concat(axis = var_44, interleave = var_106_interleave_0, values = (model_backbone_embeddings_cls_token_to_fp16, patch_pos_embed_cast_fp16))[name = tensor<string, []>("op_106_cast_fp16")];
            tensor<fp16, [1, 1037, 384]> input_3_cast_fp16 = add(x = embeddings_3_cast_fp16, y = var_106_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<int32, [3]> var_112 = const()[name = tensor<string, []>("op_112"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<int32, [1]> inputs_1_axes_0 = const()[name = tensor<string, []>("inputs_1_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 384, 1037]> transpose_20 = transpose(perm = var_112, x = input_3_cast_fp16)[name = tensor<string, []>("transpose_20")];
            tensor<fp16, [1, 384, 1, 1037]> inputs_1_cast_fp16 = expand_dims(axes = inputs_1_axes_0, x = transpose_20)[name = tensor<string, []>("inputs_1_cast_fp16")];
            tensor<int32, [1]> input_5_axes_0 = const()[name = tensor<string, []>("input_5_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [384]> input_5_gamma_0_to_fp16 = const()[name = tensor<string, []>("input_5_gamma_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1504832)))];
            tensor<fp16, [384]> input_5_beta_0_to_fp16 = const()[name = tensor<string, []>("input_5_beta_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1505664)))];
            tensor<fp16, []> var_153_to_fp16 = const()[name = tensor<string, []>("op_153_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 384, 1, 1037]> input_5_cast_fp16 = layer_norm(axes = input_5_axes_0, beta = input_5_beta_0_to_fp16, epsilon = var_153_to_fp16, gamma = input_5_gamma_0_to_fp16, x = inputs_1_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<int32, [2]> var_170 = const()[name = tensor<string, []>("op_170"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_172 = const()[name = tensor<string, []>("op_172"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> k_1_pad_type_0 = const()[name = tensor<string, []>("k_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> k_1_pad_0 = const()[name = tensor<string, []>("k_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [384, 384, 1, 1]> model_backbone_encoder_layer_0_attention_attention_key_weight_to_fp16 = const()[name = tensor<string, []>("model_backbone_encoder_layer_0_attention_attention_key_weight_to_fp16"), val = tensor<fp16, [384, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1506496)))];
            tensor<fp16, [384]> model_backbone_encoder_layer_0_attention_attention_key_bias_to_fp16 = const()[name = tensor<string, []>("model_backbone_encoder_layer_0_attention_attention_key_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1801472)))];
            tensor<fp16, [1, 384, 1, 1037]> k_1_cast_fp16 = conv(bias = model_backbone_encoder_layer_0_attention_attention_key_bias_to_fp16, dilations = var_172, groups = var_44, pad = k_1_pad_0, pad_type = k_1_pad_type_0, strides = var_170, weight = model_backbone_encoder_layer_0_attention_attention_key_weight_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("k_1_cast_fp16")];
            tensor<int32, [2]> var_177 = const()[name = tensor<string, []>("op_177"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_179 = const()[name = tensor<string, []>("op_179"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> v_1_pad_type_0 = const()[name = tensor<string, []>("v_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> v_1_pad_0 = const()[name = tensor<string, []>("v_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [384, 384, 1, 1]> model_backbone_encoder_layer_0_attention_attention_value_weight_to_fp16 = const()[name = tensor<string, []>("model_backbone_encoder_layer_0_attention_attention_value_weight_to_fp16"), val = tensor<fp16, [384, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1802304)))];
            tensor<fp16, [384]> model_backbone_encoder_layer_0_attention_attention_value_bias_to_fp16 = const()[name = tensor<string, []>("model_backbone_encoder_layer_0_attention_attention_value_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2097280)))];
            tensor<fp16, [1, 384, 1, 1037]> v_1_cast_fp16 = conv(bias = model_backbone_encoder_layer_0_attention_attention_value_bias_to_fp16, dilations = var_179, groups = var_44, pad = v_1_pad_0, pad_type = v_1_pad_type_0, strides = var_177, weight = model_backbone_encoder_layer_0_attention_attention_value_weight_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("v_1_cast_fp16")];
            tensor<int32, [2]> var_184 = const()[name = tensor<string, []>("op_184"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_186 = const()[name = tensor<string, []>("op_186"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> q_1_pad_type_0 = const()[name = tensor<string, []>("q_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> q_1_pad_0 = const()[name = tensor<string, []>("q_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [384, 384, 1, 1]> model_backbone_encoder_layer_0_attention_attention_query_weight_to_fp16 = const()[name = tensor<string, []>("model_backbone_encoder_layer_0_attention_attention_query_weight_to_fp16"), val = tensor<fp16, [384, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2098112)))];
            tensor<fp16, [384]> model_backbone_encoder_layer_0_attention_attention_query_bias_to_fp16 = const()[name = tensor<string, []>("model_backbone_encoder_layer_0_attention_attention_query_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2393088)))];
            tensor<fp16, [1, 384, 1, 1037]> q_1_cast_fp16 = conv(bias = model_backbone_encoder_layer_0_attention_attention_query_bias_to_fp16, dilations = var_186, groups = var_44, pad = q_1_pad_0, pad_type = q_1_pad_type_0, strides = var_184, weight = model_backbone_encoder_layer_0_attention_attention_query_weight_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("q_1_cast_fp16")];
            tensor<int32, [4]> var_190_begin_0 = const()[name = tensor<string, []>("op_190_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_190_end_0 = const()[name = tensor<string, []>("op_190_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1037])];
            tensor<bool, [4]> var_190_end_mask_0 = const()[name = tensor<string, []>("op_190_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1037]> var_190_cast_fp16 = slice_by_index(begin = var_190_begin_0, end = var_190_end_0, end_mask = var_190_end_mask_0, x = q_1_cast_fp16)[name = tensor<string, []>("op_190_cast_fp16")];
            tensor<int32, [4]> var_194_begin_0 = const()[name = tensor<string, []>("op_194_begin_0"), val = tensor<int32, [4]>([0, 64, 0, 0])];
            tensor<int32, [4]> var_194_end_0 = const()[name = tensor<string, []>("op_194_end_0"), val = tensor<int32, [4]>([1, 128, 1, 1037])];
            tensor<bool, [4]> var_194_end_mask_0 = const()[name = tensor<string, []>("op_194_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1037]> var_194_cast_fp16 = slice_by_index(begin = var_194_begin_0, end = var_194_end_0, end_mask = var_194_end_mask_0, x = q_1_cast_fp16)[name = tensor<string, []>("op_194_cast_fp16")];
            tensor<int32, [4]> var_198_begin_0 = const()[name = tensor<string, []>("op_198_begin_0"), val = tensor<int32, [4]>([0, 128, 0, 0])];
            tensor<int32, [4]> var_198_end_0 = const()[name = tensor<string, []>("op_198_end_0"), val = tensor<int32, [4]>([1, 192, 1, 1037])];
            tensor<bool, [4]> var_198_end_mask_0 = const()[name = tensor<string, []>("op_198_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1037]> var_198_cast_fp16 = slice_by_index(begin = var_198_begin_0, end = var_198_end_0, end_mask = var_198_end_mask_0, x = q_1_cast_fp16)[name = tensor<string, []>("op_198_cast_fp16")];
            tensor<int32, [4]> var_202_begin_0 = const()[name = tensor<string, []>("op_202_begin_0"), val = tensor<int32, [4]>([0, 192, 0, 0])];
            tensor<int32, [4]> var_202_end_0 = const()[name = tensor<string, []>("op_202_end_0"), val = tensor<int32, [4]>([1, 256, 1, 1037])];
            tensor<bool, [4]> var_202_end_mask_0 = const()[name = tensor<string, []>("op_202_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1037]> var_202_cast_fp16 = slice_by_index(begin = var_202_begin_0, end = var_202_end_0, end_mask = var_202_end_mask_0, x = q_1_cast_fp16)[name = tensor<string, []>("op_202_cast_fp16")];
            tensor<int32, [4]> var_206_begin_0 = const()[name = tensor<string, []>("op_206_begin_0"), val = tensor<int32, [4]>([0, 256, 0, 0])];
            tensor<int32, [4]> var_206_end_0 = const()[name = tensor<string, []>("op_206_end_0"), val = tensor<int32, [4]>([1, 320, 1, 1037])];
            tensor<bool, [4]> var_206_end_mask_0 = const()[name = tensor<string, []>("op_206_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1037]> var_206_cast_fp16 = slice_by_index(begin = var_206_begin_0, end = var_206_end_0, end_mask = var_206_end_mask_0, x = q_1_cast_fp16)[name = tensor<string, []>("op_206_cast_fp16")];
            tensor<int32, [4]> var_210_begin_0 = const()[name = tensor<string, []>("op_210_begin_0"), val = tensor<int32, [4]>([0, 320, 0, 0])];
            tensor<int32, [4]> var_210_end_0 = const()[name = tensor<string, []>("op_210_end_0"), val = tensor<int32, [4]>([1, 384, 1, 1037])];
            tensor<bool, [4]> var_210_end_mask_0 = const()[name = tensor<string, []>("op_210_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1037]> var_210_cast_fp16 = slice_by_index(begin = var_210_begin_0, end = var_210_end_0, end_mask = var_210_end_mask_0, x = q_1_cast_fp16)[name = tensor<string, []>("op_210_cast_fp16")];
            tensor<int32, [4]> k_3_perm_0 = const()[name = tensor<string, []>("k_3_perm_0"), val = tensor<int32, [4]>([0, 3, 2, 1])];
            tensor<int32, [4]> var_217_begin_0 = const()[name = tensor<string, []>("op_217_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_217_end_0 = const()[name = tensor<string, []>("op_217_end_0"), val = tensor<int32, [4]>([1, 1037, 1, 64])];
            tensor<bool, [4]> var_217_end_mask_0 = const()[name = tensor<string, []>("op_217_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 1037, 1, 384]> transpose_19 = transpose(perm = k_3_perm_0, x = k_1_cast_fp16)[name = tensor<string, []>("transpose_19")];
            tensor<fp16, [1, 1037, 1, 64]> var_217_cast_fp16 = slice_by_index(begin = var_217_begin_0, end = var_217_end_0, end_mask = var_217_end_mask_0, x = transpose_19)[name = tensor<string, []>("op_217_cast_fp16")];
            tensor<int32, [4]> var_221_begin_0 = const()[name = tensor<string, []>("op_221_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 64])];
            tensor<int32, [4]> var_221_end_0 = const()[name = tensor<string, []>("op_221_end_0"), val = tensor<int32, [4]>([1, 1037, 1, 128])];
            tensor<bool, [4]> var_221_end_mask_0 = const()[name = tensor<string, []>("op_221_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 1037, 1, 64]> var_221_cast_fp16 = slice_by_index(begin = var_221_begin_0, end = var_221_end_0, end_mask = var_221_end_mask_0, x = transpose_19)[name = tensor<string, []>("op_221_cast_fp16")];
            tensor<int32, [4]> var_225_begin_0 = const()[name = tensor<string, []>("op_225_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 128])];
            tensor<int32, [4]> var_225_end_0 = const()[name = tensor<string, []>("op_225_end_0"), val = tensor<int32, [4]>([1, 1037, 1, 192])];
            tensor<bool, [4]> var_225_end_mask_0 = const()[name = tensor<string, []>("op_225_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 1037, 1, 64]> var_225_cast_fp16 = slice_by_index(begin = var_225_begin_0, end = var_225_end_0, end_mask = var_225_end_mask_0, x = transpose_19)[name = tensor<string, []>("op_225_cast_fp16")];
            tensor<int32, [4]> var_229_begin_0 = const()[name = tensor<string, []>("op_229_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 192])];
            tensor<int32, [4]> var_229_end_0 = const()[name = tensor<string, []>("op_229_end_0"), val = tensor<int32, [4]>([1, 1037, 1, 256])];
            tensor<bool, [4]> var_229_end_mask_0 = const()[name = tensor<string, []>("op_229_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 1037, 1, 64]> var_229_cast_fp16 = slice_by_index(begin = var_229_begin_0, end = var_229_end_0, end_mask = var_229_end_mask_0, x = transpose_19)[name = tensor<string, []>("op_229_cast_fp16")];
            tensor<int32, [4]> var_233_begin_0 = const()[name = tensor<string, []>("op_233_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 256])];
            tensor<int32, [4]> var_233_end_0 = const()[name = tensor<string, []>("op_233_end_0"), val = tensor<int32, [4]>([1, 1037, 1, 320])];
            tensor<bool, [4]> var_233_end_mask_0 = const()[name = tensor<string, []>("op_233_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 1037, 1, 64]> var_233_cast_fp16 = slice_by_index(begin = var_233_begin_0, end = var_233_end_0, end_mask = var_233_end_mask_0, x = transpose_19)[name = tensor<string, []>("op_233_cast_fp16")];
            tensor<int32, [4]> var_237_begin_0 = const()[name = tensor<string, []>("op_237_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 320])];
            tensor<int32, [4]> var_237_end_0 = const()[name = tensor<string, []>("op_237_end_0"), val = tensor<int32, [4]>([1, 1037, 1, 384])];
            tensor<bool, [4]> var_237_end_mask_0 = const()[name = tensor<string, []>("op_237_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 1037, 1, 64]> var_237_cast_fp16 = slice_by_index(begin = var_237_begin_0, end = var_237_end_0, end_mask = var_237_end_mask_0, x = transpose_19)[name = tensor<string, []>("op_237_cast_fp16")];
            tensor<int32, [4]> var_239_begin_0 = const()[name = tensor<string, []>("op_239_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_239_end_0 = const()[name = tensor<string, []>("op_239_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1037])];
            tensor<bool, [4]> var_239_end_mask_0 = const()[name = tensor<string, []>("op_239_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1037]> var_239_cast_fp16 = slice_by_index(begin = var_239_begin_0, end = var_239_end_0, end_mask = var_239_end_mask_0, x = v_1_cast_fp16)[name = tensor<string, []>("op_239_cast_fp16")];
            tensor<int32, [4]> var_243_begin_0 = const()[name = tensor<string, []>("op_243_begin_0"), val = tensor<int32, [4]>([0, 64, 0, 0])];
            tensor<int32, [4]> var_243_end_0 = const()[name = tensor<string, []>("op_243_end_0"), val = tensor<int32, [4]>([1, 128, 1, 1037])];
            tensor<bool, [4]> var_243_end_mask_0 = const()[name = tensor<string, []>("op_243_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1037]> var_243_cast_fp16 = slice_by_index(begin = var_243_begin_0, end = var_243_end_0, end_mask = var_243_end_mask_0, x = v_1_cast_fp16)[name = tensor<string, []>("op_243_cast_fp16")];
            tensor<int32, [4]> var_247_begin_0 = const()[name = tensor<string, []>("op_247_begin_0"), val = tensor<int32, [4]>([0, 128, 0, 0])];
            tensor<int32, [4]> var_247_end_0 = const()[name = tensor<string, []>("op_247_end_0"), val = tensor<int32, [4]>([1, 192, 1, 1037])];
            tensor<bool, [4]> var_247_end_mask_0 = const()[name = tensor<string, []>("op_247_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1037]> var_247_cast_fp16 = slice_by_index(begin = var_247_begin_0, end = var_247_end_0, end_mask = var_247_end_mask_0, x = v_1_cast_fp16)[name = tensor<string, []>("op_247_cast_fp16")];
            tensor<int32, [4]> var_251_begin_0 = const()[name = tensor<string, []>("op_251_begin_0"), val = tensor<int32, [4]>([0, 192, 0, 0])];
            tensor<int32, [4]> var_251_end_0 = const()[name = tensor<string, []>("op_251_end_0"), val = tensor<int32, [4]>([1, 256, 1, 1037])];
            tensor<bool, [4]> var_251_end_mask_0 = const()[name = tensor<string, []>("op_251_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1037]> var_251_cast_fp16 = slice_by_index(begin = var_251_begin_0, end = var_251_end_0, end_mask = var_251_end_mask_0, x = v_1_cast_fp16)[name = tensor<string, []>("op_251_cast_fp16")];
            tensor<int32, [4]> var_255_begin_0 = const()[name = tensor<string, []>("op_255_begin_0"), val = tensor<int32, [4]>([0, 256, 0, 0])];
            tensor<int32, [4]> var_255_end_0 = const()[name = tensor<string, []>("op_255_end_0"), val = tensor<int32, [4]>([1, 320, 1, 1037])];
            tensor<bool, [4]> var_255_end_mask_0 = const()[name = tensor<string, []>("op_255_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1037]> var_255_cast_fp16 = slice_by_index(begin = var_255_begin_0, end = var_255_end_0, end_mask = var_255_end_mask_0, x = v_1_cast_fp16)[name = tensor<string, []>("op_255_cast_fp16")];
            tensor<int32, [4]> var_259_begin_0 = const()[name = tensor<string, []>("op_259_begin_0"), val = tensor<int32, [4]>([0, 320, 0, 0])];
            tensor<int32, [4]> var_259_end_0 = const()[name = tensor<string, []>("op_259_end_0"), val = tensor<int32, [4]>([1, 384, 1, 1037])];
            tensor<bool, [4]> var_259_end_mask_0 = const()[name = tensor<string, []>("op_259_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1037]> var_259_cast_fp16 = slice_by_index(begin = var_259_begin_0, end = var_259_end_0, end_mask = var_259_end_mask_0, x = v_1_cast_fp16)[name = tensor<string, []>("op_259_cast_fp16")];
            tensor<string, []> var_263_equation_0 = const()[name = tensor<string, []>("op_263_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1037, 1, 1037]> var_263_cast_fp16 = einsum(equation = var_263_equation_0, values = (var_217_cast_fp16, var_190_cast_fp16))[name = tensor<string, []>("op_263_cast_fp16")];
            tensor<fp16, []> var_264_to_fp16 = const()[name = tensor<string, []>("op_264_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 1037, 1, 1037]> aw_1_cast_fp16 = mul(x = var_263_cast_fp16, y = var_264_to_fp16)[name = tensor<string, []>("aw_1_cast_fp16")];
            tensor<string, []> var_267_equation_0 = const()[name = tensor<string, []>("op_267_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1037, 1, 1037]> var_267_cast_fp16 = einsum(equation = var_267_equation_0, values = (var_221_cast_fp16, var_194_cast_fp16))[name = tensor<string, []>("op_267_cast_fp16")];
            tensor<fp16, []> var_268_to_fp16 = const()[name = tensor<string, []>("op_268_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 1037, 1, 1037]> aw_3_cast_fp16 = mul(x = var_267_cast_fp16, y = var_268_to_fp16)[name = tensor<string, []>("aw_3_cast_fp16")];
            tensor<string, []> var_271_equation_0 = const()[name = tensor<string, []>("op_271_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1037, 1, 1037]> var_271_cast_fp16 = einsum(equation = var_271_equation_0, values = (var_225_cast_fp16, var_198_cast_fp16))[name = tensor<string, []>("op_271_cast_fp16")];
            tensor<fp16, []> var_272_to_fp16 = const()[name = tensor<string, []>("op_272_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 1037, 1, 1037]> aw_5_cast_fp16 = mul(x = var_271_cast_fp16, y = var_272_to_fp16)[name = tensor<string, []>("aw_5_cast_fp16")];
            tensor<string, []> var_275_equation_0 = const()[name = tensor<string, []>("op_275_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1037, 1, 1037]> var_275_cast_fp16 = einsum(equation = var_275_equation_0, values = (var_229_cast_fp16, var_202_cast_fp16))[name = tensor<string, []>("op_275_cast_fp16")];
            tensor<fp16, []> var_276_to_fp16 = const()[name = tensor<string, []>("op_276_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 1037, 1, 1037]> aw_7_cast_fp16 = mul(x = var_275_cast_fp16, y = var_276_to_fp16)[name = tensor<string, []>("aw_7_cast_fp16")];
            tensor<string, []> var_279_equation_0 = const()[name = tensor<string, []>("op_279_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1037, 1, 1037]> var_279_cast_fp16 = einsum(equation = var_279_equation_0, values = (var_233_cast_fp16, var_206_cast_fp16))[name = tensor<string, []>("op_279_cast_fp16")];
            tensor<fp16, []> var_280_to_fp16 = const()[name = tensor<string, []>("op_280_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 1037, 1, 1037]> aw_9_cast_fp16 = mul(x = var_279_cast_fp16, y = var_280_to_fp16)[name = tensor<string, []>("aw_9_cast_fp16")];
            tensor<string, []> var_283_equation_0 = const()[name = tensor<string, []>("op_283_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1037, 1, 1037]> var_283_cast_fp16 = einsum(equation = var_283_equation_0, values = (var_237_cast_fp16, var_210_cast_fp16))[name = tensor<string, []>("op_283_cast_fp16")];
            tensor<fp16, []> var_284_to_fp16 = const()[name = tensor<string, []>("op_284_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 1037, 1, 1037]> aw_11_cast_fp16 = mul(x = var_283_cast_fp16, y = var_284_to_fp16)[name = tensor<string, []>("aw_11_cast_fp16")];
            tensor<fp16, [1, 1037, 1, 1037]> var_286_cast_fp16 = softmax(axis = var_44, x = aw_1_cast_fp16)[name = tensor<string, []>("op_286_cast_fp16")];
            tensor<fp16, [1, 1037, 1, 1037]> var_287_cast_fp16 = softmax(axis = var_44, x = aw_3_cast_fp16)[name = tensor<string, []>("op_287_cast_fp16")];
            tensor<fp16, [1, 1037, 1, 1037]> var_288_cast_fp16 = softmax(axis = var_44, x = aw_5_cast_fp16)[name = tensor<string, []>("op_288_cast_fp16")];
            tensor<fp16, [1, 1037, 1, 1037]> var_289_cast_fp16 = softmax(axis = var_44, x = aw_7_cast_fp16)[name = tensor<string, []>("op_289_cast_fp16")];
            tensor<fp16, [1, 1037, 1, 1037]> var_290_cast_fp16 = softmax(axis = var_44, x = aw_9_cast_fp16)[name = tensor<string, []>("op_290_cast_fp16")];
            tensor<fp16, [1, 1037, 1, 1037]> var_291_cast_fp16 = softmax(axis = var_44, x = aw_11_cast_fp16)[name = tensor<string, []>("op_291_cast_fp16")];
            tensor<string, []> var_293_equation_0 = const()[name = tensor<string, []>("op_293_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1037]> var_293_cast_fp16 = einsum(equation = var_293_equation_0, values = (var_239_cast_fp16, var_286_cast_fp16))[name = tensor<string, []>("op_293_cast_fp16")];
            tensor<string, []> var_295_equation_0 = const()[name = tensor<string, []>("op_295_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1037]> var_295_cast_fp16 = einsum(equation = var_295_equation_0, values = (var_243_cast_fp16, var_287_cast_fp16))[name = tensor<string, []>("op_295_cast_fp16")];
            tensor<string, []> var_297_equation_0 = const()[name = tensor<string, []>("op_297_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1037]> var_297_cast_fp16 = einsum(equation = var_297_equation_0, values = (var_247_cast_fp16, var_288_cast_fp16))[name = tensor<string, []>("op_297_cast_fp16")];
            tensor<string, []> var_299_equation_0 = const()[name = tensor<string, []>("op_299_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1037]> var_299_cast_fp16 = einsum(equation = var_299_equation_0, values = (var_251_cast_fp16, var_289_cast_fp16))[name = tensor<string, []>("op_299_cast_fp16")];
            tensor<string, []> var_301_equation_0 = const()[name = tensor<string, []>("op_301_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1037]> var_301_cast_fp16 = einsum(equation = var_301_equation_0, values = (var_255_cast_fp16, var_290_cast_fp16))[name = tensor<string, []>("op_301_cast_fp16")];
            tensor<string, []> var_303_equation_0 = const()[name = tensor<string, []>("op_303_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1037]> var_303_cast_fp16 = einsum(equation = var_303_equation_0, values = (var_259_cast_fp16, var_291_cast_fp16))[name = tensor<string, []>("op_303_cast_fp16")];
            tensor<bool, []> input_7_interleave_0 = const()[name = tensor<string, []>("input_7_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 384, 1, 1037]> input_7_cast_fp16 = concat(axis = var_44, interleave = input_7_interleave_0, values = (var_293_cast_fp16, var_295_cast_fp16, var_297_cast_fp16, var_299_cast_fp16, var_301_cast_fp16, var_303_cast_fp16))[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<int32, [2]> var_309 = const()[name = tensor<string, []>("op_309"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_311 = const()[name = tensor<string, []>("op_311"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_9_pad_type_0 = const()[name = tensor<string, []>("input_9_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_9_pad_0 = const()[name = tensor<string, []>("input_9_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [384, 384, 1, 1]> attention_output_1_weight_0_to_fp16 = const()[name = tensor<string, []>("attention_output_1_weight_0_to_fp16"), val = tensor<fp16, [384, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2393920)))];
            tensor<fp16, [384]> attention_output_1_bias_0_to_fp16 = const()[name = tensor<string, []>("attention_output_1_bias_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2688896)))];
            tensor<fp16, [1, 384, 1, 1037]> attention_output_1_cast_fp16 = conv(bias = attention_output_1_bias_0_to_fp16, dilations = var_311, groups = var_44, pad = input_9_pad_0, pad_type = input_9_pad_type_0, strides = var_309, weight = attention_output_1_weight_0_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("attention_output_1_cast_fp16")];
            tensor<fp16, [1, 384, 1, 1037]> inputs_3_cast_fp16 = add(x = attention_output_1_cast_fp16, y = inputs_1_cast_fp16)[name = tensor<string, []>("inputs_3_cast_fp16")];
            tensor<int32, [1]> input_11_axes_0 = const()[name = tensor<string, []>("input_11_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [384]> input_11_gamma_0_to_fp16 = const()[name = tensor<string, []>("input_11_gamma_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2689728)))];
            tensor<fp16, [384]> input_11_beta_0_to_fp16 = const()[name = tensor<string, []>("input_11_beta_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2690560)))];
            tensor<fp16, []> var_329_to_fp16 = const()[name = tensor<string, []>("op_329_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 384, 1, 1037]> input_11_cast_fp16 = layer_norm(axes = input_11_axes_0, beta = input_11_beta_0_to_fp16, epsilon = var_329_to_fp16, gamma = input_11_gamma_0_to_fp16, x = inputs_3_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<int32, [2]> var_343 = const()[name = tensor<string, []>("op_343"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_345 = const()[name = tensor<string, []>("op_345"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_13_pad_type_0 = const()[name = tensor<string, []>("input_13_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_13_pad_0 = const()[name = tensor<string, []>("input_13_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1536, 384, 1, 1]> model_backbone_encoder_layer_0_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("model_backbone_encoder_layer_0_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [1536, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2691392)))];
            tensor<fp16, [1536]> model_backbone_encoder_layer_0_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("model_backbone_encoder_layer_0_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3871104)))];
            tensor<fp16, [1, 1536, 1, 1037]> input_13_cast_fp16 = conv(bias = model_backbone_encoder_layer_0_mlp_fc1_bias_to_fp16, dilations = var_345, groups = var_44, pad = input_13_pad_0, pad_type = input_13_pad_type_0, strides = var_343, weight = model_backbone_encoder_layer_0_mlp_fc1_weight_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<string, []> input_15_mode_0 = const()[name = tensor<string, []>("input_15_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1536, 1, 1037]> input_15_cast_fp16 = gelu(mode = input_15_mode_0, x = input_13_cast_fp16)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<int32, [2]> var_351 = const()[name = tensor<string, []>("op_351"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_353 = const()[name = tensor<string, []>("op_353"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_state_3_pad_type_0 = const()[name = tensor<string, []>("hidden_state_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_state_3_pad_0 = const()[name = tensor<string, []>("hidden_state_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [384, 1536, 1, 1]> layer_output_1_weight_0_to_fp16 = const()[name = tensor<string, []>("layer_output_1_weight_0_to_fp16"), val = tensor<fp16, [384, 1536, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3874240)))];
            tensor<fp16, [384]> layer_output_1_bias_0_to_fp16 = const()[name = tensor<string, []>("layer_output_1_bias_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5053952)))];
            tensor<fp16, [1, 384, 1, 1037]> layer_output_1_cast_fp16 = conv(bias = layer_output_1_bias_0_to_fp16, dilations = var_353, groups = var_44, pad = hidden_state_3_pad_0, pad_type = hidden_state_3_pad_type_0, strides = var_351, weight = layer_output_1_weight_0_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("layer_output_1_cast_fp16")];
            tensor<fp16, [1, 384, 1, 1037]> inputs_5_cast_fp16 = add(x = layer_output_1_cast_fp16, y = inputs_3_cast_fp16)[name = tensor<string, []>("inputs_5_cast_fp16")];
            tensor<int32, [1]> input_17_axes_0 = const()[name = tensor<string, []>("input_17_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [384]> input_17_gamma_0_to_fp16 = const()[name = tensor<string, []>("input_17_gamma_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5054784)))];
            tensor<fp16, [384]> input_17_beta_0_to_fp16 = const()[name = tensor<string, []>("input_17_beta_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5055616)))];
            tensor<fp16, []> var_376_to_fp16 = const()[name = tensor<string, []>("op_376_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 384, 1, 1037]> input_17_cast_fp16 = layer_norm(axes = input_17_axes_0, beta = input_17_beta_0_to_fp16, epsilon = var_376_to_fp16, gamma = input_17_gamma_0_to_fp16, x = inputs_5_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<int32, [2]> var_393 = const()[name = tensor<string, []>("op_393"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_395 = const()[name = tensor<string, []>("op_395"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> k_5_pad_type_0 = const()[name = tensor<string, []>("k_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> k_5_pad_0 = const()[name = tensor<string, []>("k_5_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [384, 384, 1, 1]> model_backbone_encoder_layer_1_attention_attention_key_weight_to_fp16 = const()[name = tensor<string, []>("model_backbone_encoder_layer_1_attention_attention_key_weight_to_fp16"), val = tensor<fp16, [384, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5056448)))];
            tensor<fp16, [384]> model_backbone_encoder_layer_1_attention_attention_key_bias_to_fp16 = const()[name = tensor<string, []>("model_backbone_encoder_layer_1_attention_attention_key_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5351424)))];
            tensor<fp16, [1, 384, 1, 1037]> k_5_cast_fp16 = conv(bias = model_backbone_encoder_layer_1_attention_attention_key_bias_to_fp16, dilations = var_395, groups = var_44, pad = k_5_pad_0, pad_type = k_5_pad_type_0, strides = var_393, weight = model_backbone_encoder_layer_1_attention_attention_key_weight_to_fp16, x = input_17_cast_fp16)[name = tensor<string, []>("k_5_cast_fp16")];
            tensor<int32, [2]> var_400 = const()[name = tensor<string, []>("op_400"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_402 = const()[name = tensor<string, []>("op_402"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> v_3_pad_type_0 = const()[name = tensor<string, []>("v_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> v_3_pad_0 = const()[name = tensor<string, []>("v_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [384, 384, 1, 1]> model_backbone_encoder_layer_1_attention_attention_value_weight_to_fp16 = const()[name = tensor<string, []>("model_backbone_encoder_layer_1_attention_attention_value_weight_to_fp16"), val = tensor<fp16, [384, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5352256)))];
            tensor<fp16, [384]> model_backbone_encoder_layer_1_attention_attention_value_bias_to_fp16 = const()[name = tensor<string, []>("model_backbone_encoder_layer_1_attention_attention_value_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5647232)))];
            tensor<fp16, [1, 384, 1, 1037]> v_3_cast_fp16 = conv(bias = model_backbone_encoder_layer_1_attention_attention_value_bias_to_fp16, dilations = var_402, groups = var_44, pad = v_3_pad_0, pad_type = v_3_pad_type_0, strides = var_400, weight = model_backbone_encoder_layer_1_attention_attention_value_weight_to_fp16, x = input_17_cast_fp16)[name = tensor<string, []>("v_3_cast_fp16")];
            tensor<int32, [2]> var_407 = const()[name = tensor<string, []>("op_407"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_409 = const()[name = tensor<string, []>("op_409"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> q_3_pad_type_0 = const()[name = tensor<string, []>("q_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> q_3_pad_0 = const()[name = tensor<string, []>("q_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [384, 384, 1, 1]> model_backbone_encoder_layer_1_attention_attention_query_weight_to_fp16 = const()[name = tensor<string, []>("model_backbone_encoder_layer_1_attention_attention_query_weight_to_fp16"), val = tensor<fp16, [384, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5648064)))];
            tensor<fp16, [384]> model_backbone_encoder_layer_1_attention_attention_query_bias_to_fp16 = const()[name = tensor<string, []>("model_backbone_encoder_layer_1_attention_attention_query_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5943040)))];
            tensor<fp16, [1, 384, 1, 1037]> q_3_cast_fp16 = conv(bias = model_backbone_encoder_layer_1_attention_attention_query_bias_to_fp16, dilations = var_409, groups = var_44, pad = q_3_pad_0, pad_type = q_3_pad_type_0, strides = var_407, weight = model_backbone_encoder_layer_1_attention_attention_query_weight_to_fp16, x = input_17_cast_fp16)[name = tensor<string, []>("q_3_cast_fp16")];
            tensor<int32, [4]> var_413_begin_0 = const()[name = tensor<string, []>("op_413_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_413_end_0 = const()[name = tensor<string, []>("op_413_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1037])];
            tensor<bool, [4]> var_413_end_mask_0 = const()[name = tensor<string, []>("op_413_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1037]> var_413_cast_fp16 = slice_by_index(begin = var_413_begin_0, end = var_413_end_0, end_mask = var_413_end_mask_0, x = q_3_cast_fp16)[name = tensor<string, []>("op_413_cast_fp16")];
            tensor<int32, [4]> var_417_begin_0 = const()[name = tensor<string, []>("op_417_begin_0"), val = tensor<int32, [4]>([0, 64, 0, 0])];
            tensor<int32, [4]> var_417_end_0 = const()[name = tensor<string, []>("op_417_end_0"), val = tensor<int32, [4]>([1, 128, 1, 1037])];
            tensor<bool, [4]> var_417_end_mask_0 = const()[name = tensor<string, []>("op_417_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1037]> var_417_cast_fp16 = slice_by_index(begin = var_417_begin_0, end = var_417_end_0, end_mask = var_417_end_mask_0, x = q_3_cast_fp16)[name = tensor<string, []>("op_417_cast_fp16")];
            tensor<int32, [4]> var_421_begin_0 = const()[name = tensor<string, []>("op_421_begin_0"), val = tensor<int32, [4]>([0, 128, 0, 0])];
            tensor<int32, [4]> var_421_end_0 = const()[name = tensor<string, []>("op_421_end_0"), val = tensor<int32, [4]>([1, 192, 1, 1037])];
            tensor<bool, [4]> var_421_end_mask_0 = const()[name = tensor<string, []>("op_421_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1037]> var_421_cast_fp16 = slice_by_index(begin = var_421_begin_0, end = var_421_end_0, end_mask = var_421_end_mask_0, x = q_3_cast_fp16)[name = tensor<string, []>("op_421_cast_fp16")];
            tensor<int32, [4]> var_425_begin_0 = const()[name = tensor<string, []>("op_425_begin_0"), val = tensor<int32, [4]>([0, 192, 0, 0])];
            tensor<int32, [4]> var_425_end_0 = const()[name = tensor<string, []>("op_425_end_0"), val = tensor<int32, [4]>([1, 256, 1, 1037])];
            tensor<bool, [4]> var_425_end_mask_0 = const()[name = tensor<string, []>("op_425_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1037]> var_425_cast_fp16 = slice_by_index(begin = var_425_begin_0, end = var_425_end_0, end_mask = var_425_end_mask_0, x = q_3_cast_fp16)[name = tensor<string, []>("op_425_cast_fp16")];
            tensor<int32, [4]> var_429_begin_0 = const()[name = tensor<string, []>("op_429_begin_0"), val = tensor<int32, [4]>([0, 256, 0, 0])];
            tensor<int32, [4]> var_429_end_0 = const()[name = tensor<string, []>("op_429_end_0"), val = tensor<int32, [4]>([1, 320, 1, 1037])];
            tensor<bool, [4]> var_429_end_mask_0 = const()[name = tensor<string, []>("op_429_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1037]> var_429_cast_fp16 = slice_by_index(begin = var_429_begin_0, end = var_429_end_0, end_mask = var_429_end_mask_0, x = q_3_cast_fp16)[name = tensor<string, []>("op_429_cast_fp16")];
            tensor<int32, [4]> var_433_begin_0 = const()[name = tensor<string, []>("op_433_begin_0"), val = tensor<int32, [4]>([0, 320, 0, 0])];
            tensor<int32, [4]> var_433_end_0 = const()[name = tensor<string, []>("op_433_end_0"), val = tensor<int32, [4]>([1, 384, 1, 1037])];
            tensor<bool, [4]> var_433_end_mask_0 = const()[name = tensor<string, []>("op_433_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1037]> var_433_cast_fp16 = slice_by_index(begin = var_433_begin_0, end = var_433_end_0, end_mask = var_433_end_mask_0, x = q_3_cast_fp16)[name = tensor<string, []>("op_433_cast_fp16")];
            tensor<int32, [4]> k_7_perm_0 = const()[name = tensor<string, []>("k_7_perm_0"), val = tensor<int32, [4]>([0, 3, 2, 1])];
            tensor<int32, [4]> var_440_begin_0 = const()[name = tensor<string, []>("op_440_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_440_end_0 = const()[name = tensor<string, []>("op_440_end_0"), val = tensor<int32, [4]>([1, 1037, 1, 64])];
            tensor<bool, [4]> var_440_end_mask_0 = const()[name = tensor<string, []>("op_440_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 1037, 1, 384]> transpose_18 = transpose(perm = k_7_perm_0, x = k_5_cast_fp16)[name = tensor<string, []>("transpose_18")];
            tensor<fp16, [1, 1037, 1, 64]> var_440_cast_fp16 = slice_by_index(begin = var_440_begin_0, end = var_440_end_0, end_mask = var_440_end_mask_0, x = transpose_18)[name = tensor<string, []>("op_440_cast_fp16")];
